\c "FinDB"

SET search_path TO report, public;

INSERT INTO report.reasons (name) VALUES
    ('Выплата'),
    ('Стипендия'),
    ('Пособие'),
    ('Перевод'),
    ('Возврат'),
    ('Перерасчет'),
    ('Cashback'),
    ('Пожертвование'),
    ('Подарок'),
    ('Помощь'),

    ('Еда'),
    ('Жилье'),
    ('Быт'),
    ('Транспорт'),
    ('Такси'),
    ('Интернет'),
    ('Подписка'),
    ('Связь'),

    ('Здоровье'),
    ('Спорт'),
    ('Развлечение'),
    ('Образование'),
    ('Канцелярия'),
    ('Билеты'),

    ('Одежда'),
    ('Обувь'),
    ('Мебель'),
    ('Техника'),
    ('Заказ'),

    ('Семья'),
    ('Комиссия'),
    ('Фиаско')
ON CONFLICT (name) DO NOTHING;
